{
    "demo": [
        "Definition: In this task you are given a sentence. You must judge whether the object of the main clause is singular(like: apple) or plural(like: apartments). Label the instances as \"Singular\" or \"Plural\" based on your judgment.\n\nInput: I reach my chambers and am relieved to find them empty.\nOutput: Plural",
        "Definition: You will be given a topic and an argument. Decide the argument's stance towards that topic. The argument's stance is in favor or against the topic. If the argument supports that topic, answer with \"in favor\"; otherwise, if the argument opposes the topic, answer with \"against\".\n\nInput: topic: No-fly zone over Libya\nargument: Libyans cannot oust Gaddafi on their own\nOutput: in favor",
        "Definition: In this task you are given a tweet. You must judge whether the author of the tweet is sad or not. Label the instances as \"Sad\" or \"Not sad\" based on your judgment. You can get help from hashtags and emojis, but you should not judge only based on them, and should pay attention to tweet's text as well.\n\nInput: @charles_gaba @NateSilver538 @DavMicRot @FiveThirtyEight A litany of name-calling. How dull.\nOutput: Not sad",
        "Definition: In this task you are given a sentence pair from wikipedia that have high lexical overlap. If the sentences have the same meaning and are just paraphrases of each other label them as \"Paraphrase\" , if not label them as \"Not paraphrase\". The two sentences are seperated by a new line.\n\nInput: He played in 189 Belgian Pro - League - games during thirteen seasons , mostly with Club Brugge , with which he won nine important titles , including two national championships .\nHe played in 189 Belgian Pro - League - games during thirteen seasons , mainly with Club Bruges , with which he won nine national titles , including two big championships .\nOutput: Not paraphrase",
        "Definition: In this task, you are given a short story consisting of exactly 5 sentences where the second sentence is missing. You are given two options and you need to select the one that best connects the first sentence with the rest of the story. Indicate your answer by 'Option 1' if the first option is correct, otherwise 'Option 2'. The incorrect option will change the subsequent storyline, so that at least one of the three subsequent sentences is no longer consistent with the story.\n\nInput: Sentence 1: I've always wanted to do over a hundred push ups. \n Sentence 3: I worked at it for months, doing some everyday \n Sentence 4:  I also got plenty of rest and ate all good food \n Sentence 5:  A few months later I reached my goal! \n Option 1: Right now I can do about fifty. \n Option 2: Right now I just broke my arm.\nOutput: Option 1",
        "Definition: In this task, you are given the name of an Indian food dish. You need to classify the dish as a \"main course\", \"dessert\" or \"snack\".\n\nInput: Handwo\nOutput: snack",
        "Definition: In this task, you are given a question and answer options for that question. Using this information, you have to classify each text into different topics: medicine, nursery, psychology, chemistry, pharmacology, biology.\n\nInput: Question: In phase II of the diet due to acute gastroenteritis, what food should be avoided ?: \n Options:  <0> Potato. <1> Toasted bread. <2> Grape. <3> Quince. <4> Semolina.\nOutput: nursery",
        "Definition: Given a pair of words, generate the relation between them. The first word is called the 'concept' and the second word is called the 'relatum' The relation must be one of the following: co-hyponym (coordinate), hypernym, meronym, attribute, event, or random. A coordinate relation indicates that the concept and relatum belong to the same semantic class. A hypernym relation indicates that the relatum is a category of which the concept is a specific instance. A meronym relation implies that relatum is a part/component/organ/member of the concept. An attribute relation is when the relatum is an adjective expressing an attribute of the concept. An event relation holds when the relatum is a verb referring to an action/activity/happening/event that is performed by or with the concept. If the relatum and concept are unrelated, the relation between them is 'random'. Classify your answers into coord, hyper, mero, attri, event, and random.\n\nInput: Concept: fighter, Relatum: start.\nOutput: random"
    ]
}