{
    "demo": [
            "Definition: Classify the relation of question with context to one of these categories: 1) award received, 2) based on, collection, 3) conflict, 4) constellation, 5) convicted of, 6) date of death, 7) director, 8) drafted by, 9) educated at, 10) medical condition, 11) military branch, 12) narrative location, 13) occupation, 14) original network, 15) parent company, 16) point in time, 17) production company, 18) residence, 19) series, 20) service entry, 21) sex or gender, 22) spouse, 23) standards body question.\n\nInput: Context : House From Hell is an Australian reality television series that screened on Network Ten in 1998. \nQuestion : What network first aired House From Hell?\nOutput: original network",
            "Definition: You will be given two pieces of text with the same meaning. One of them is simpler and easier to understand for non-native English speakers. Complex texts may contain more difficult words, have unnecessary phrases or contain long sentences. Your task is to choose the simpler piece of text. You are expected to output 'Text one' if the first sentence is simpler. Otherwise output 'Text two'.\n\nInput: Text one: The river starts at Lulusar lake, 48km from Naran Valley.\n Text two: The river starts at Lulusar lake, 48km from Naran Valley.\nOutput: Text one",
            "Definition: In this task, you are given a public comment from online platforms. You are expected to classify the comment into two classes: disagree or agree. Classify the comment as disagree if it is likely to raise a certain level of public disagreement, whether healthy or unhealthy. The disagreement can be due to toxic content (for example, disrespect, identity attack, insult, and threat), controversial content, misunderstandings, or conflicting opinions. Classify the comment as agree otherwise.\n\nInput: Comment: Actually, this money is just sitting in the Permanent Fund earnings account.  No one has actually spent any of it, yet.  Legislative action is needed to spend this money.  So basically, Walker decreed: \"I'm keeping half of your PFD ... until I can figure out how to waste it.  Then I will spend it all on a bloated government that I will not cut and my pet projects.\"\nOutput: Agree",
            "Definition: In this task, you are given a sentence. You must judge whether a single noun or verb has been replaced with another word with the same part of speech. The inversion would result in the sentence sounding unnatural, So unnatural sentences will be considered changed. Label the instances as \"Original\" or \"Changed\" based on your judgment.\n\nInput: \" Why was it deprived ? \"\nOutput: Changed",
            "Definition: In this task, you are given a public comment from online platforms. You are expected to classify the comment into two classes: toxic and non-toxic. Toxicity is defiend as anything that is rude, disrespectful, or unreasonable that would make someone want to leave a converation.\n\nInput: Comment: Man, just die already.\nOutput: Toxic",
            "Definition: You will be given two sentences. One of them is created by paraphrasing the original one, with changes on an aspect, or using synonyms. Your task is to decide what is the difference between two sentences. Types of change are explained below:\n Tense: The verbs in the sentence are changed in tense.\nNumber: Plural nouns, verbs and pronouns are changed into single ones or the other way around.\nVoice: If the verbs are in active voice, they're changed to passive or the other way around.\nAdverb: The paraphrase has one adverb or more than the original sentence.\nGender: The paraphrase differs from the original sentence in the gender of the names and pronouns.\nSynonym: Some words or phrases of the original sentence are replaced with synonym words or phrases. Changes in the names of people are also considered a synonym change. Classify your answers into Tense, Number, Voice, Adverb, Gender, and Synonym.\n\nInput: original sentence: Pete envies Martin although he is very successful . paraphrase: Anna envies Emma although she is very successful .\nOutput: Gender",
            "Definition: You will be given a topic and an argument. Decide the argument's stance towards that topic. The argument's stance is in favor or against the topic. If the argument supports that topic, answer with \"in favor\"; otherwise, if the argument opposes the topic, answer with \"against\".\n\nInput: topic: DC handgun ban\nargument: A handgun ban deprives citizens of the most commonly used weapon for self defense\nOutput: against",
            "Definition: In this task you are given a tweet that contains some form of irony. You must classify the type of irony the tweet has. Label the tweets (\"polarity\",\"situational\",\"other\") based on the irony they have. Situational irony happens when a situation fails to meet some expectations, Label these instances as \"situational\". polarity irony happens when irony is achieved by inverting the intended sentence, Label these instances as \"polarity\". There are other kinds of ironies that are neither polarity nor situational, Label these instances as \"other\". Note that URLs in the text have been replaced with [Link].\n\nInput: :unamused_face: Half of the testing group was very helpful today.\nOutput: polarity"
    ]
}