{
    "demo": [
            "Definition: In this task, you are given a public comment from online platforms. You are expected to classify the comment into two classes: insult and non-insult. Insult is any lanugage or act that is disrespectful or scornfully abusive.\n\nInput: Comment: UR  a daehtaem edualc\nOutput: Non-insult",
            "Definition: In this task you are given a tweet. You must judge whether the author of the tweet is happy or not. Label the instances as \"Happy\" or \"Not happy\" based on your judgment.\n\nInput: Take #photographs of life and write them in #journals #motivation #inspiration #life  #love #inspire #smile #quotestoliveby\nOutput: Happy",
            "Definition: You will be given a topic and an argument. Decide the argument's stance towards that topic. The argument's stance is in favor or against the topic. If the argument supports that topic, answer with \"in favor\"; otherwise, if the argument opposes the topic, answer with \"against\".\n\nInput: topic: Legalization of Marijuana\nargument: Marijuana use can lead to cancer\nOutput: against",
            "Definition: Given a sentence, judge the quality of this sentence by indicating \"Good\" and \"Bad\". The quality depends on the grammar and the meaning of the sentence. If a sentence is easily understandable, and doesn't have grammatical errors, answer with \"Good\", otherwise answer with \"Bad\".\n\nInput: The Times of London reports that Alex Balk knew of the Pope's plea to free Augusto Pinochet.\nOutput: Good",
            "Definition: In this task, you are given a public comment from online platforms. You are expected to classify the comment into two classes: sexual-explicit and non-sexual-explicit. A comment is considered sexual-explicit if it explicitly portrays sexual matters.\n\nInput: Comment: This low level of punishment is compounded even more because Bergdahl was traded for five-count 'em: FIVE- known and dedicated leaders of the Islamic extremist groups with which we are at war.\nOutput: Non-sexual-explicit",
            "Definition: In this task you are given a statement and an explanation giving you further knowledge about an entity in the statement. You must judge whether the statement is true or false based on the explanation. Label an instance as \"True\" if the explanation confirms the statement or doesn't disprove it. Label an instance as \"False\" if the explanation disproves the statement. The statement and explanation are separated by a newline character.\n\nInput: The maternal uncle of Sammy Sosa named him Mickey.\nThe maternal grandmother of Sammy Sosa suggested his birth name of Samuel, and also came up with his nickname, Mikey.\nOutput: False",
            "Definition: Classify the given tweet into the three categories: (1) 'Hate Speech', (2) 'Offensive' and (3) 'Neither'. 'Hate Speech' is kind of a threating statement or sometimes include call for violence while 'offensive' statement just offensds someone. 'Neither' is when it doesn't fall into Hate Speech or Offensive category.\n\nInput: I can't blow bubbles or whistle. I'm basically retarded.\nOutput: Hate Speech",
            "Definition: In this task, you are given a string with unique characters in it and you need to return the character from the string which has the maximum ASCII value. ASCII stands for American Standard Code For Information Interchange and It assigns a unique number to each character. The characters [a - z] have an ASCII range of 97-122 and [A-Z] have an ASCII range of 65-90 respectively.\n\nInput: vpbIGwacxXQoJOAgZ\nOutput: x"
    ]
}