{
    "demo": [
            "Definition: Given a sentence, judge the quality of this sentence by indicating \"Good\" and \"Bad\". The quality depends on the grammar and the meaning of the sentence. If a sentence is easily understandable, and doesn't have grammatical errors, answer with \"Good\", otherwise answer with \"Bad\".\n\nInput: Why was IUC on Philanthropy was founded and i am asking for support of our mission today.\nOutput: Bad",
            "Definition: In this task, you are given a news headline in English. You are expected to classify the post into two classes: sarcastic or non-sarcastic. A sarcastic sentence is one that refers to the use of words that mean the opposite of what you really want to say, especially in order to insult someone, or to show irritation, or just to be funny.\n\nInput: dhs announces racial profiling free-for-all this sept. 11\nOutput: sarcastic",
            "Definition: You're given a sentence and your task is to classify whether the sentence is acceptable or not. Any sentence which is grammatically correct, has a naturalistic text, is written by a native speaker and which minimizes superfluous content is acceptable, otherwise unacceptable. If the sentence is acceptable then write \"acceptable\", otherwise \"unacceptable\".\n\nInput: My brother is an Einstein at maths.\nOutput: acceptable",
            "Definition: In this task, you're given text messages in natural language. Your task is to classify those text messages based on their content into two classes: (1) Spam and (2) Ham messages. If the content of the given message is irrelevant to the receiver or is equally relevant to many other potential recipients then it must be labeled as ‘spam’, otherwise, it should be labeled as ‘ham’.\n\nInput: Awesome, I'll see you in a bit\nOutput: ham",
            "Definition: In this task you are given a sentence pair from wikipedia that have high lexical overlap. If the sentences have the same meaning and are just paraphrases of each other label them as \"Paraphrase\" , if not label them as \"Not paraphrase\". The two sentences are seperated by a new line.\n\nInput: It also has entertaining and highly informative soft news features , as well as opinionated national and local columnists .\nIt also has informative soft and high-meaning national and local news features as well as entertaining columnists .\nOutput: Not paraphrase",
            "Definition: In this task, you are given a hateful post in English from online platforms. You are expected to classify the target being harassed in the post as individual or generic, i.e., single person or a group of people. Note that the URLs in the text have been replaced with [Link].\n\nInput: Post: @LindseyGrahamSC @BarackObama @realDonaldTrump Yea, I dont think so asshole . I think your a pussy who has gone corrupt if you werent before , treasonous if you werent already . You were NEVER John McCain's friend . You were never a friend to America . Yo\nOutput: Individual",
            "Definition: We would like you to assess the QUALITY of each of the following argument (discussing Gun Control) and determine if the argument is Valid or Invalid. A valid argument is clearly interpretable and either expresses an argument, or a premise or a conclusion that can be used in an argument for the topic of gun control. An invalid argument is a phrase that cannot be interpreted as an argument or not on the topic of gun control.\n\nInput: Meaning that a countless number of magazines capable of holding more than 10 round of ammunition had immunity and couldn't be touched by the bill.\nOutput: Valid",
            "Definition: In this task you will be given a text passage from a trivia quiz. You should choose the category this question belongs to from these categories: History, Science, Social Science, Fine Arts, Literature. You can only choose one category, so if in doubt, please choose the closest match.\n\nInput: The title event of this work is preceded by Jasiu winning a wrestling match against an opponent who walks into the sea, and its protagonist has a nightmare about flute-playing forces of the \"strangergod. \" A street singer convinces that protagonist that he only has to fear sirocco, contradicting the British agents warnings that Lido Beach is infested with Indian cholera. Thus, the main character does not warn the Polish family he has observed of the danger. For 10 points, Tadzio causes the title event upon Gustav von Aschenbach in what Thomas Mann novella\nOutput: Literature"
    ]
}