{
    "demo": [
        "Definition : You are given two sentences(Sentence1 and Sentence2). Answer \"Yes\" if these sentences are a paraphrase of one another, otherwise answer \"No\".\n\nInput: Sentence1: Vaccine makers have been thrust in the limelight following government programmes to encourage wider vaccination and fears of biological attacks on civilian and military targets ., Sentence2: Vaccine makers have been thrust into the limelight as government programs encourage wider vaccination amid fears of biological attacks .\nOutput: Yes",
        "Definition : The input is taken from a negotiation between two participants who take the role of campsite neighbors and negotiate for Food, Water, and Firewood packages, based on their individual preferences and requirements. Given an utterance and recent dialogue context containing past 3 utterances (wherever available), output Yes if the utterance contains the elicit-pref strategy, otherwise output No. elicit-pref is a cooperative negotiation strategy. It is used to discover the preference order of the opponent in the negotiation.\n\nInput: Context: 'You are flipping it around. I can't give you 2 water and 2 firewood as that wouldn't really be fair ' 'Okay, how about if I give you 3 foods and you give me the 2 firewoods and 2 waters?' 'THanks, but I really need the water. I thought you would enjoy the food with so  many guests in your campsite. Is that a possibility?'\nUtterance: 'I don't need 3 foods and we already agreed on 2 firewood, 1 water and 2 food. If that is not possible, I wonder if we can not make a deal '\nOutput: No",
        "Definition : The input is a conversation between an automated system and a user, followed by a question. The user is looking for suggestions for pubs, restaurants and coffee shops in Cambridge. In the dialogue, the user may provide some criteria for the type of place they want such as price range, cuisine, etc. Similarly, the user may ask details of the place suggested by the system such as phone number, address, etc. The answer of the question has to be a Yes or a No. Given such a dialogue, answer the given question based on the information present in the dialogue.\n\nInput: System: 'Thank you for calling the Cambridge Information system. Your call will be recorded for research purposes. You may ask for information about a place to eat, such as a restaurant, a pub, or a cafe. How may I help you?'\nUser: 'pub'\nSystem: 'What kind of venue are you looking for? For example, a cafe, or a pub.'\nUser: 'want a moderately priced pub and it should have a tv'\nSystem: 'The Alma, which has a television, is in the moderate price range. It's an outstanding pub.'\nUser: 'alright thank you good bye'\nSystem: 'The Alma, which is in the moderate price range, is an outstanding pub.'\nUser: 'thank you good bye'\nQuestion: 'Did the user mention the area in which they are looking for restaurants?'\n\nOutput: No",
        "Definition : In this task, you are given two phrases: Head and Tail, separated with <sep>. The Head and the Tail events are short phrases possibly involving participants. The names of specific people have been replaced by generic words (e.g., PersonX, PersonY, PersonZ). PersonX is always the subject of the event. You have to determine whether the Head is located or can be found at/in/on the Tail or not. Classify your answers into \"Yes\" and \"No\". The phrase may also contain \"___\", a placeholder that can be an object, a person, and/or an action.\n\nInput: Head: fox<sep>Tail: back yard\nOutput: Yes",
        "Definition : Categorize the comment on the basis of severe toxicity. If the comment is severely toxic output Yes, otherwise output No.\n\nInput: it is not the hail or fail of either party for Donald trump - it is the whole system...I believe Donald trump is the closest clone of hitler so far... god help us  - what a commentary on the state of affairs here.  we the people are at each others throat - constantly..in our entertainment, in our attitudes. we've just become mean and divisive. he develops it and plays off it.  the man is a terrorist.\nOutput: Yes",
        "Definition : In this task, you are given a text from a social media post. Your task is to classify the given post into two categories: 1) yes if the given post is sexually offensive, 2) no, otherwise. Emphasis on sexually offensive or any lewd reference. Generate label 'no' for offensive posts that do not reference sexually explicit content. Warning: the examples and instances may contain offensive language.\n\nInput: RT @_LexC__: I'm convinced that some of y'all bitches get pregnant purposely because \"birth control &amp; plan b pills\" are effective &#128533;&#128056;&#9749;&#65039;\nOutput: No",
        "Definition : If the emotion of happiness is present in the one of the dialogues of the conversation, then output Yes otherwise output No\n\nInput: I'm sorry I'm late .  Better late than never . \nOutput: No",
        "Definition : Given a negotiation between two participants, answer 'Yes' if both participants agree to the deal, otherwise answer 'No'.\n\nInput: THEM: hi can i have one hat and one ball?  YOU: i need the same. if i can have the hat and one ball and one book you can have the other ball and the books  THEM: well the books have no value to me  YOU: you can have the balls if i can have the hat and the books  THEM: can i have just the hat?  YOU: okay deal.  THEM: ok.\nOutput: Yes"
    ]
}