{
    "demo": [
        "Definition: In this task, you will be shown an incorrect English sentence. You need to generate a corrected form of the input sentence.\n\nHowever , are these things all good to people ? \nOutput: However , are these things all good to people ? ",
        "Definition: In this task, you are given a hateful post in English from online platforms. You are expected to classify the post into two classes: aggresive or non-aggresive. An aggresive post is one that expresses feelings and opinions in an abusive way and tries to dominate others. Note that the URLs in the text have been replaced with [Link].\n\nInput: Post: @burnthewitchiii come tell this bitch to get in the fucking sea. Please. Before I cunt punch her. \nOutput: Aggresive",
        "Definition: In this task, you will be shown a correct English sentence. You need to generate an incorrect form of the input sentence.\n\nFinally , the third reason is that that birds use a type of internal compass ; birds have crystals of the mineral magnetite embedded in their beaks . \nOutput: finally the third cause that birds use a type of internal compass , birds have crystals of the mineral magetite embedded in their break . ",
        "Definition: Given a sentence, fill out the missing word with a 'no' or a number (between zero and ten). You should write the numbers with english alphabet, like: four instead of 4.\n\nEagles have between ____ and three eggs per year.\nOutput: one",
        "Definition: You will be given two pieces of text with the same meaning. One of them is simpler and easier to understand for non-native English speakers. Complex texts may contain more difficult words, have unnecessary phrases or contain long sentences. Your task is to choose the simpler piece of text. You are expected to output 'Text one' if the first sentence is simpler. Otherwise output 'Text two'.\n\nInput: Text one: Rollins retired in 1962 and opted to become a coach.\n Text two: Rollins retired in 1962. He then chose to become a coach.\nOutput: Text two",
        "Definition: You are given a sentence in Arabic. Your job is to translate the Arabic sentence into Spanish.\n\nحسنًا ، قد يكون فيلماً كارثياً.\nOutput: Podría ser una película de desastres.",
        "Definition: The provided files include famous book titles and sentences in the English language, and we ask you to translate those to the Finnish Language. Please bear in mind the following guidelines while doing the translation: 1) We are looking for the most naturally written and form of each sentence in the Finnish language. 2) Also names ,dates and places should be preserved it should not get translated.\n\nThen fourteen miles away the great convict prison of Princetown.\nOutput: Neljäntoista penikulman päässä on rangaistusvankila Princetown.",
        "Definition: In this task, you're given the middle and ending of a three-part story. Your job is to complete the short story by writing a probable beginning of the story. Generated sentences must be short, have fewer than 10 words, and be simple as if narrating to a child. Avoid using any irrelevant extra information when creating the beginning, and use names (e.g. Jack, Barbara,...) instead of pronouns (e.g. he / she) wherever possible.\n\nMiddle: She got some braids that was pink and blue. Ending: Her mother took her to a stylist to fix the mess.\nOutput: Amy wanted to look more adult."
    ]
}