{
    "demo": [
        "Definition: The provided file includes inquiries about restaurants, and we ask you to translate those to the Italian language. Please bear in mind the following guidlines while doing the translation: 1) We are looking for the most naturally written and formal form of each sentence in your language. We are *NOT* looking for colloquial forms of the sentence. We are looking for formal form which is how you would type your queries in a text-based virtual assistant. 2) The words between quotation marks *SHOULD NOT* be translated. We expect you to keep those values intact and include the quotation marks around them as well. 3) The fully capitalized words like DATE_0, or DURATION_0 *SHOULD NOT* be translated. Please keep them as they are in the translations. 4) Please do not localize measurement units like miles to kilometers during your translation. miles should be translated to its equivalent in your language. 6) Note the input is all lowercased except for special placeholders. Please do the same in your translations.\n\nlook for a \" japanese \" restaurant that is the closest to me .\nOutput: cerca un ristorante \" japanese \" nelle mie vicinanze.",
        "Definition: In this task, you are given a hateful post in English from online platforms. You are expected to classify the post into two classes: aggresive or non-aggresive. An aggresive post is one that expresses feelings and opinions in an abusive way and tries to dominate others. Note that the URLs in the text have been replaced with [Link].\n\nInput: Post: @burnthewitchiii come tell this bitch to get in the fucking sea. Please. Before I cunt punch her. \nOutput: Aggresive",
        "Definition: In this task, you're given a context, further information available on a particular linked term from the statement, and an answer term. Your job is to generate a question that can use the information provided to obtain the given answer. You should use the information on both context and link information to create the question. Note that the answer to the question should be exactly the given answer, and if the answer is none, the answer to the question shouldn't be obtainable from the context or linked information.\n\nContext: n 1986 he appeared as Florestan in Beethoven's Fidelio at the Metropolitan Opera, opposite Hildegard Behrens Link Information: \n\nHildegard Behrens (9 February 1937 – 18 August 2009)  Answer: 1937 \nOutput: What year was Schunk's co-star in Beethoven's Fidelio born?",
        "Definition: In this task, you will be shown a correct English sentence. You need to generate an incorrect form of the input sentence.\n\nFinally , the third reason is that that birds use a type of internal compass ; birds have crystals of the mineral magnetite embedded in their beaks . \nOutput: finally the third cause that birds use a type of internal compass , birds have crystals of the mineral magetite embedded in their break . ",
        "Definition: You will be given two pieces of text with the same meaning. One of them is simpler and easier to understand for non-native English speakers. Complex texts may contain more difficult words, have unnecessary phrases or contain long sentences. Your task is to choose the simpler piece of text. You are expected to output 'Text one' if the first sentence is simpler. Otherwise output 'Text two'.\n\nInput: Text one: Rollins retired in 1962 and opted to become a coach.\n Text two: Rollins retired in 1962. He then chose to become a coach.\nOutput: Text two",
        "Definition: You are given a target person and two sentences. Your task is to determine whether the second sentence conveys either a stereotype, anti-stereotype, or is unrelated with respect to the first sentence and the target.  A stereotype is a widely held but oversimplified notion of a group of people. An anti-stereotype is an idea that goes against the widely held but oversimplified notion of a group of people. Sentences and targets are unrelated if there is no relevance between them.\n\nInput: Target: himself \nHe is proud of himself. My phone is off.\nOutput: unrelated",
        "Definition: You are given a question. You need to detect which category better describes the question. A question belongs to the description category if it asks about description and abstract concepts. Entity questions are about entities such as animals, colors, sports, etc. Abbreviation questions ask about abbreviations and expressions abbreviated. Questions regarding human beings, description of a person, and a group or organization of persons are categorized as Human. Quantity questions are asking about numeric values and Location questions ask about locations, cities, and countries. Answer with \"Description\", \"Entity\", \"Abbreviation\", \"Person\", \"Quantity\", and \"Location\".\n\nInput: What is the oldest building in the United States ?\nOutput: Location",
        "Definition: In this task, you will be shown an incorrect English sentence. You need to generate a corrected form of the input sentence.\n\nHowever , are these things all good to people ? \nOutput: However , are these things all good to people ? "
    ]
}