{
    "demo": [
        "Definition: In this task, you will be shown an incorrect English sentence. You need to generate a corrected form of the input sentence.\n\nHe thinks differently from other people and he succeded . \nOutput: He thinks differently than others and he has succeeded . ",
        "Definition: In this task, you are given a sentence or phrase in Xhosa. You must translate it to English in a way that is equivalent in terms of meaning and grammatically correct.\n\nXa isikhephe simalunga neeyadi ezingamashumi amahlanu ukuba sifike apho siyakhona uyalelo oluthi \"izikhuseli phandle \"luyanikwa lulandelwe ngumyalelo othi \"umphambili\"\nOutput: When the boat is within 50 yards or so of her destination the order ‘Fenders out' is given, followed by the order 'Bows'.",
        "Definition: In this task, you will be shown a correct English sentence. You need to generate an incorrect form of the input sentence.\n\nHowever , are all these things good for people ? \nOutput: However , are these things all good to people ? ",
        "Definition: Given a sentence, fill out the missing word with a 'no' or a number (between zero and ten). You should write the numbers with english alphabet, like: four instead of 4.\n\nToucans live in small flocks of five or ____ birds.\nOutput: six",
        "Definition: In this task, you need to reverse the order of words in the given sentence.\n\nSentence: there is a man standing alone side of a train\nOutput: train a of side alone standing man a is there",
        "Definition: You are given a sentence in Arabic. Your job is to translate the Arabic sentence into Spanish.\n\nهل هناك أيّ شعور آخر يعلّمنا النّظر بتلك الكيفية القوية ؟\nOutput: ¿Alguna otra emoción que nos enseñe a mirar con intensidad tan peculiar?",
        "Definition: The provided files include famous book titles and sentences in the English language, and we ask you to translate those to the Finnish Language. Please bear in mind the following guidelines while doing the translation: 1) We are looking for the most naturally written and form of each sentence in the Finnish language. 2) Also names ,dates and places should be preserved it should not get translated.\n\nOf course, if Dr. Mortimer's surmise should be correct, and we are dealing with forces outside the ordinary laws of Nature, there is an end of our investigation.\nOutput: Jos tohtori Mortimerin otaksuma on oikea, ja tässä siis olemme tekemisissä sellaisten voimien kanssa, jotka ovat tunnettujen luonnonlakien yläpuolella, niin on tutkimuksemme lopussa.",
        "Definition: In this task, you're given the middle and ending of a three-part story. Your job is to complete the short story by writing a probable beginning of the story. Generated sentences must be short, have fewer than 10 words, and be simple as if narrating to a child. Avoid using any irrelevant extra information when creating the beginning, and use names (e.g. Jack, Barbara,...) instead of pronouns (e.g. he / she) wherever possible.\n\nMiddle: Tom quickly drove to Clint's house. Ending: He arrived just in time to surprise Clint with the gift.\nOutput: Tom bought some shells for Clint's birthday."
    ]
}