{
    "demo": [
        "Definition: In this task, you are given the name of an Indian food dish. You need to classify the dish as \"sweet\" or \"spicy\". \n\nInput: The new UFC... \nOutput: sweet",
        "Definition: In this task, you are given two natural language statements with similar wording. You must choose the statement that makes less sense based on common sense knowledge. A ' ' separates the statements. Use \"first\" or \"second\" to indicate which sentence makes less sense. \n\nInput: (Photo by Mark Rightmire, Orange County Register/SCNG) That's what a fighter's mindset is. \nOutput: first",
        "Definition: In this task, you are given a public comment from online platforms. You are expected to classify the comment into two classes: sexual-explicit and non-sexual-explicit. A comment is considered sexual-explicit if it explicitly portrays sexual matters. \n\nInput: u201cWere pushing back, the official said, speaking on condition of anonymity. Ripple Effect\\nJuly 1, 6 p.m. Our state has incredible people thats about moving forward. \nOutput: Non-sexual-explicit",
        "Definition: In this task, you are given a sentence. You must judge whether a single noun or verb has been replaced with another word with the same part of speech. The inversion would result in the sentence sounding unnatural, So unnatural sentences will be considered changed. Label the instances as \"Original\" or \"Changed\" based on your judgment. \n\nInput: In the top of the third, Jesus Pulido led off with a single before Roberto Cabrera moved him over to second base off a sacrifice bunt. \nOutput: Original",
        "Definition: You are given a short poem which is written by a kid. Your task is to predict if the kid is in elementary school or high school. Anyone who is from grade 1st to 6th-grade will be considered as in elementary school, and 7th to 12th-grade kids will be considered as in high school. There are only two possible outputs, i.e., elementary and high. All inputs have at least one output and it cannot have both categories at a time. \n\nInput: The World Herald reports Greater Omaha Packing is set this morning to load a test run of beef for shipment to a customer in China. \nOutput: elementary",
        "Definition: In this task, you are given a text from a social media post. Your task is to classify the given post into two categories: 1) yes if the given post is intentionally offensive, 2) no, otherwise. Also, generate label 'no' for offensive statements that appear to be unintentional, or non-offensive statements that are underhandedly offensive. Warning: the examples and instances may contain offensive language. \n\nInput: State reduces company's fine for failing to plug 2 wells\\nKENAI, Alaska (AP) He found a way to connect with everybody here, Francona said. \nOutput: Yes",
        "Definition: In this task, you are given a public comment from online platforms. You are expected to classify the comment into two classes: toxic and non-toxic. Toxicity is defiend as anything that is rude, disrespectful, or unreasonable that would make someone want to leave a converation. \n\nInput: Click to enlarge .THURSDAY By Counseling LOL. ADVERTISEMENT Mazda6 Edwards- Nice! #TruthRISING. -All lnorden@mww.com 2. France:\\n15. 3. ... Image jlinville@mtairynews.com NIGHT... .THURSDAY Against: L. Email: OK iBooks Twitter\\nWhatsApp\\nGoogle\\nTumblr\\nLinkedIn\\nSkype Sunny. Getty Related ... ___ lbeamish@postmedia.com WhatsApp .MONDAY Industrial ... ... .THURSDAY [1.9.6_1107] * ... Sunny. 1. 8. NIGHT... info@newyorkclassical.org 9/15 485 \nOutput: Non-toxic",
        "Definition: Given a comment text in Malayalam, classify the comment into one of these categories (i) Hope speech, (ii) Not Hope Speech or (iii) Not in Expected Language. From the world of acting, Oscar-winner Mark Rylance and Moonlight star Naomie Harris were among those honored this year.  \n\nInput: u201cIve tried to be a good person,  a good parent and husband. \nOutput: Hope Speech"
    ]
}