{
    "demo": [
        "Definition: Given a comment, classify it into a 'hate' speech or 'not hate' speech. Answer using 'hate' or 'not hate'.\n\nInput: I support lgbt… i want youre support for lgbt in pakistan\nOutput: not hate",
        "Definition: In this task, you are given a public comment from online platforms. You are expected to classify the comment into two classes: insult and non-insult. Insult is any lanugage or act that is disrespectful or scornfully abusive.\n\nInput: Comment: Trudeau is trying to keep this low key. Now he is going to apologize on behalf of all Canadians. Trudeau better not say all Canadians. or even just Canadians. He should apologize on behalf of the Liberal party.\nOutput: Non-insult",
        "Definition: You are given a short poem which is written by a kid. Your task is to predict if the kid is in elementary school or high school. Anyone who is from grade 1st to 6th-grade will be considered as in elementary school, and 7th to 12th-grade kids will be considered as in high school. There are only two possible outputs, i.e., elementary and high. All inputs have at least one output and it cannot have both categories at a time.\n\nInput: i love the weekend i play in the sun i play in the sun because it fun i love the weekend\nOutput: elementary",
        "Definition: In this task you are given a tweet. You must judge whether the tweet is ironic or not. We define two type of irony for this task (\"polarity\",\"situational\"). Situational irony happens when a situation fails to meet some expectations. polarity irony happens when irony is achieved by inverting the intended sentence. Label the instances as \"ironic\" or \"not\" based on your judgment. Note that URLs in the text have been replaced with [Link].\n\nInput: [Link] #Landlord collects #Rent from #HoneyBees in #BeeHive ... #Bee #Honey #ItalianBees [Link]\nOutput: not",
        "Definition: In this task, you are given a post in English from online platforms. You are expected to identify whether the post is hateful against immigrants and women. A hateful post expresses hate or encourages violence towards a person or a group. If a post is hateful but not towards immigrants and women, it should be labeled as non-hateful. Answer \"hateful\" or \"Non-hateful\". Note that the URLs in the text have been replaced with [Link].\n\nInput: Post: @driverminnie @realDonaldTrump I'm British and I would welcome him into my home! You do not speak for the British....and funnily enough you didn't speak out previously about detaining illegal immigrant families under all 8 years of Obama rule, you virue s\nOutput: Non-hateful",
        "Definition: You are given a target person and two sentences. Your task is to determine whether the second sentence conveys either a stereotype, anti-stereotype, or is unrelated with respect to the first sentence and the target.  A stereotype is a widely held but oversimplified notion of a group of people. An anti-stereotype is an idea that goes against the widely held but oversimplified notion of a group of people. Sentences and targets are unrelated if there is no relevance between them.\n\nInput: Target: mother \nI have  a mother. She is always protective of her kids.\nOutput: stereotype",
        "Definition: In this task you will be given a text passage from a trivia quiz. You should choose the category this question belongs to from these categories: History, Science, Social Science, Fine Arts, Literature. You can only choose one category, so if in doubt, please choose the closest match.\n\nInput: His real name was Zahiruddin Muhammad. He succeeded his father as sovereign of Fergana and repeatedly tried to take Samarkand, the capital of his Timurid ancestors. He then focused his attention on India, where he won the Battle of Panipat with an army of 21,000 against an army of 100,000, then conquered much of northern India and established his capital at Agra. FTP, name this man, founder of the Mughal dynasty of India and whose name literally means \"The Tiger\".\nOutput: History", 
        "Definition: Given a pair of words, generate the relation between them. The first word is called the 'concept' and the second word is called the 'relatum' The relation must be one of the following: co-hyponym (coordinate), hypernym, meronym, attribute, event, or random. A coordinate relation indicates that the concept and relatum belong to the same semantic class. A hypernym relation indicates that the relatum is a category of which the concept is a specific instance. A meronym relation implies that relatum is a part/component/organ/member of the concept. An attribute relation is when the relatum is an adjective expressing an attribute of the concept. An event relation holds when the relatum is a verb referring to an action/activity/happening/event that is performed by or with the concept. If the relatum and concept are unrelated, the relation between them is 'random'. Classify your answers into coord, hyper, mero, attri, event, and random.\n\nInput: Concept: pistol, Relatum: magazine.\nOutput: mero"
    ]
}