{
    "demo": [
        "Definition: In this task, you are given the name of an Indian food dish. You need to return whether the dish is \"non vegetarian\" or \"vegetarian\". Do not answer with any words other than those two.\n\nInput: Chhena poda\nOutput: vegetarian",
        "Definition: You are given a piece of text. You should find out if there are any gender specific criticized comments. Label the text as 'gender criticism' or 'not gender criticism'\n\nInput: well it's clear now why europeans can't differ niggers and shitskins from human\nOutput: not gender criticism",
        "Definition: You are given an array of integers, check if it is monotonic or not. If the array is monotonic, then return 1, else return 2. An array is monotonic if it is either monotonically increasing or monotonocally decreasing. An array is monotonically increasing/decreasing if its elements increase/decrease as we move from left to right\n\nInput: [17, 24, 31, 38, 45, 52, 59, 66, 73, 80, 87, 94, 101, 108]\nOutput: 1",
        "Definition: You're given a sentence and your task is to classify whether the sentence is acceptable or not. Any sentence which is grammatically correct, has a naturalistic text, is written by a native speaker and which minimizes superfluous content is acceptable, otherwise unacceptable. If the sentence is acceptable then write \"acceptable\", otherwise \"unacceptable\".\n\nInput: Ellen told Helen a story.\nOutput: acceptable",
        "Definition: You need to answer the question 'Are the given steps in order?', given a set of steps describing a process. Your answer must be either Yes or No. If the answer is No, that means the steps are out of order and do not make sense in the order they are in. If the answer is Yes, that means the steps are in order and make sense in the order that they are in. A set of steps are not in order if the steps reference information that is introduced in a later step\n\nInput:  ['Salt water is contained in a factory or plant', 'The salt becomes seperated from the water', 'The water is able to be drank at this point.', 'The water is boiled to a very high tempature', 'The salt is removed'] \nOutput:   No  ",
        "Definition: In this task, you are given the name of an Indian food dish. You need to classify the dish as a \"main course\", \"dessert\" or \"snack\".\n\nInput: Methi na Gota\nOutput: main course",
        "Definition: You are given a target person and two sentences. Your task is to determine whether the second sentence conveys either a stereotype, anti-stereotype, or is unrelated with respect to the first sentence and the target.  A stereotype is a widely held but oversimplified notion of a group of people. An anti-stereotype is an idea that goes against the widely held but oversimplified notion of a group of people. Sentences and targets are unrelated if there is no relevance between them.\n\nInput: Target: gentlemen \nThe gentlemen were  at a lunch meeting. They sang happy birthday to the little boy.\nOutput: anti-stereotype",
        "Definition: In this task, you are given a news article. Your task is to classify the article to one out of the four topics 'World', 'Sports', 'Business', 'Sci/Tech' if the article's main topic is relevant to the world, sports, business, and science/technology, correspondingly. If you are not sure about the topic, choose the closest option. Note that URLs in the text have been replaced with [Link].\n\nInput: Tech Stocks End Slightly Higher on Intel US technology stocks ended up slightly on Friday, lifted by a higher sales forecast from bellwether Intel Corp. (INTC.O: Quote, Profile, Research) , while a disappointing jobs report capped blue-chip gains.\nOutput: Business"
    ]
}