{
    "demo": [
        "Definition: You will be given a topic and an argument. Decide the argument's stance towards that topic. The argument's stance is in favor or against the topic. If the argument supports that topic, answer with \"in favor\"; otherwise, if the argument opposes the topic, answer with \"against\".\n\nInput: topic: New START Treaty\nargument: Delay risks dangerous non-ratification.\nOutput: in favor",
        "Definition: You are given an array of integers, check if it is monotonic or not. If the array is monotonic, then return 1, else return 2. An array is monotonic if it is either monotonically increasing or monotonocally decreasing. An array is monotonically increasing/decreasing if its elements increase/decrease as we move from left to right\n\nInput: [6, 12, 18, 24, 30, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96, 102, 108]\nOutput: 1",
        "Definition: Given a sentence, judge the quality of this sentence by indicating \"Good\" and \"Bad\". The quality depends on the grammar and the meaning of the sentence. If a sentence is easily understandable, and doesn't have grammatical errors, answer with \"Good\", otherwise answer with \"Bad\".\n\nInput: But a 1978 article by Ted Bear, then a historian at Edward Air Force Base where the alleged experiment took place states\nOutput: Good",
        "Definition: We would like you to assess the QUALITY of each of the following argument (discussing Gun Control) and determine if the argument is Valid or Invalid. A valid argument is clearly interpretable and either expresses an argument, or a premise or a conclusion that can be used in an argument for the topic of gun control. An invalid argument is a phrase that cannot be interpreted as an argument or not on the topic of gun control.\n\nInput: I posted the real story of the Ft. Hood incident and also a quote that only a good man with a gun can stop a bad man with a gun.\nOutput: Valid",        
        "Definition: Classify the given tweet into the three categories: (1) 'Hate Speech', (2) 'Offensive' and (3) 'Neither'. 'Hate Speech' is kind of a threating statement or sometimes include call for violence while 'offensive' statement just offensds someone. 'Neither' is when it doesn't fall into Hate Speech or Offensive category.\n\nInput: @gonzalez_sassy ur not sassy white trash change ur username\nOutput: Hate Speech",
        "Definition: In this task, you are given a news article. Your task is to classify the article to one out of the four topics 'World', 'Sports', 'Business', 'Sci/Tech' if the article's main topic is relevant to the world, sports, business, and science/technology, correspondingly. If you are not sure about the topic, choose the closest option. Note that URLs in the text have been replaced with [Link].\n\nInput: Bone Loss a Serious Threat to Older Americans By LAURAN NEERGAARD    WASHINGTON (AP) -- Half of Americans older than 50 will be at risk of fractures from too-thin bones by 2020, the surgeon general warned Thursday, urging people to get more calcium, vitamin D and exercise to avoid crippling osteoporosis.    The bone-thinning disease is on the rise as the population grays - but weak bones aren't a natural consequence of aging, Surgeon General Richard Carmona stressed...\nOutput: Sci/Tech",
        "Definition: In this task, you are given Twitter posts. Your task is to label the post's emotion (as expressed by the user) as sadness, joy, love, anger, fear, or surprise.\n\nInput: i can tell you the things i don t feel that maybe i should be feeling but i can t really put my finger on the cause of my being shaken\nOutput: fear",
        "Definition: You are given a question. You need to detect which category better describes the question. A question belongs to the description category if it asks about description and abstract concepts. Entity questions are about entities such as animals, colors, sports, etc. Abbreviation questions ask about abbreviations and expressions abbreviated. Questions regarding human beings, description of a person, and a group or organization of persons are categorized as Human. Quantity questions are asking about numeric values and Location questions ask about locations, cities, and countries. Answer with \"Description\", \"Entity\", \"Abbreviation\", \"Person\", \"Quantity\", and \"Location\".\n\nInput: Who is the current prime minister and president of Russia ?\nOutput: Person"
    ]
}