{
    "demo": [
        "Definition: In this task, you are given the name of an Indian food dish. You need to classify the dish as \"sweet\" or \"spicy\".\n\nInput: Dharwad pedha\nOutput: sweet",
        "Definition: In this task, you are given two natural language statements with similar wording. You must choose the statement that makes less sense based on common sense knowledge. A '\n' separates the statements. Use \"first\" or \"second\" to indicate which sentence makes less sense.\n\nInput: He played the cow very well\nHe played the harp very well\nOutput: first",
        "Definition: In this task, you are given a public comment from online platforms. You are expected to classify the comment into two classes: sexual-explicit and non-sexual-explicit. A comment is considered sexual-explicit if it explicitly portrays sexual matters.\n\nInput: Comment: Actually, being wiretapped isn't something they have in common.  Merkel was tapped, Trump wasn't.  The man has more than a few screws loose.\nOutput: Non-sexual-explicit",
        "Definition: In this task, you are given a sentence. You must judge whether a single noun or verb has been replaced with another word with the same part of speech. The inversion would result in the sentence sounding unnatural, So unnatural sentences will be considered changed. Label the instances as \"Original\" or \"Changed\" based on your judgment.\n\nInput: Computers are just systems with a great amount of unconsciousness : everything held in immediate memory and subject to programs which the operator initiates .\nOutput: Original",
        "Definition: You are given a short poem which is written by a kid. Your task is to predict if the kid is in elementary school or high school. Anyone who is from grade 1st to 6th-grade will be considered as in elementary school, and 7th to 12th-grade kids will be considered as in high school. There are only two possible outputs, i.e., elementary and high. All inputs have at least one output and it cannot have both categories at a time.\n\nInput: pink be what i see skateboard be fun go home be what i want to see but when i sleep my day be do\nOutput: elementary",
        "Definition: In this task, you are given a text from a social media post. Your task is to classify the given post into two categories: 1) yes if the given post is intentionally offensive, 2) no, otherwise. Also, generate label 'no' for offensive statements that appear to be unintentional, or non-offensive statements that are underhandedly offensive.  Warning: the examples and instances may contain offensive language.\n\nInput: RT @CreationOfJay: No girl sucks dick but somehow all dudes get head. Dudes only fuck bad bitches yet all these ugly girls getting pregnant&#8230;\nOutput: Yes",
        "Definition: In this task, you are given a public comment from online platforms. You are expected to classify the comment into two classes: toxic and non-toxic. Toxicity is defiend as anything that is rude, disrespectful, or unreasonable that would make someone want to leave a converation.\n\nInput: Comment: MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MMAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MMAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MAGA! MMAGA! MAGA! MAGA! MAGA! MAGA!\nOutput: Non-toxic",
        "Definition: Given a comment text in Malayalam, classify the comment into one of these categories (i) Hope speech, (ii) Not Hope Speech or (iii) Not in Expected Language. A hope speech contains content that is encouraging, positive or supportive contents and talks about equality, diversity or inclusion\n\nInput: avare njaan kutta pedittilla society  oru kaaranama baaki njan taazhe commente cheythattond\nOutput: Hope Speech"
    ]
}