{
    "demo": [
        "Definition: Floyd Mayweather's bout with Conor McGregor will be \"the biggest fight ever\", according to UFC president Dana White. Mariota saw his first two seasons end prematurely with injuries. Its about taking calculated risks. \n\nInput: I have successfully booked your ticket with flight-1017, have a safe journey. \nOutput: agent",
        "Definition: A second offense would require the treatment unless a court determined it wouldnt be effective. But his familiarity with Gase's playbook made him the best fallback for Miami. If your focal length is 18mm, your maximum shutter speed is 27.8 seconds, (provided youre using a full-frame camera). Self-driving vehicles don't drive drunk, don't get sleepy and aren't easily distracted. \n\nInput: Post: @burnthewitchiii come tell this bitch to get in the fucking sea. Please. Before I cunt punch her. \nOutput: Aggresive",
        "Definition: We will miss our main player and it will impact the team. The battle for Brooks has been thought to be between Indiana and Kentucky. The bill also imposes sanctions on U.S. military officials in the region. Serbia 1-2 Switzerland\\n23 June\\nBelgium v Tunisia, 1pm BBC RESULT: Belgium 5-2 Tunisia \n\nInput: Sentence1: Should I ask to be put on a Statin at my checkup tomorrow? My cholesterol was very high and I'm sure it still is. Sentence2: What are the side effects of statin medications? \nOutput: Dissimilar",
        "Definition: In 2010, he returned briefly for the wedding of Bianca Jackson (Patsy Palmer) and Ricky Butcher (Sid Owen), during which time he revealed that Nita was pregnant. They are all insignificant and comparatively recent schisms, which have been brought under Roman influence either during the crusades, or much later, chiefly from political motives, to secure French protectorate. The 10-story billboard, which shows James wearing his No. 23 jersey with his arms spread wide, has become a city landmark. \n\nInput: i think that SOCOM would love guns arms that cant be dected, it would alco be useful for undercover agents. \nOutput: Valid",
        "Definition: Only when I brought on fresh people, Mata, Rashford, the team was different. But the last White House did a lot of nothing,' the official claimed. Dr. Sterns class is still in the preliminary stages of piecing together its project. A sign reminds drivers of the congestion charge in London. The first human corneas have been 3D printed by scientists at Newcastle University. Highs 84 to 93. \n\nInput: Text one: Rollins retired in 1962 and opted to become a coach. Text two: Rollins retired in 1962. He then chose to become a coach. \nOutput: Text two",
        "Definition: CRH said the company has estimated annual revenue of US$3.5-million. It's also proved to be a clear-cut case in how pathetic a major political party can be in dealing with such subversion of the national interest. Before now scientists thought land mammals were much more essential to the inhabitants' diets. A stunt staged in 1931 at Lottario, near Rome, put Tazio Nuvolari in the headlines and captured dAnnunzios attention. Well compile these lists periodically throughout the college swimming & recruiting season. \n\nInput: Target: himself He is proud of himself. My phone is off. \nOutput: unrelated",
        "Definition: Then his work-his sacrifice-has been pointless. Two points for a win, one point for overtime loss. We advise traders to trade cautiously whereas investors can continue to accumulate fundamentally sound companies. But Chiboub says her clients are also looking for everyday clothes. and we believed the verdict of the seer. Email Dnelms750@gmail.com if you are interested in learning more about Dizzy or fill out an application online at www.henricohumane.org I think we need to pursue this course of contact in discussions and exchange of views. Its a jubilant devotional whose religion is female energy. \n\nInput: What is the oldest building in the United States ? \nOutput: Location",
        "Definition: (1  unlikely, 5  very likely) But Nuri is watching him struggle and invites him inside because she doesnt want him to leave anyway. The problems begin when he removes the mouthpiece and opens his mouth. Snow level 7500 to 8000 feet. I love the idea and the concept,\" said Thomas Canna. A bomb kills nine strike-breaking workers at the Giant Yellowknife gold mine in the Northwest Territories. Apple juice or milk can be substituted for the brandy, however they are not quite as good. L. A former midfielder, he made 101 appearances for the U.S. team. OK We werent dominated while we were playing shorthanded, but we definitely didnt excel, he said. Agarwal could argue that the group trades at a discount to the sum of its parts. Annual event now takes revelers through the streets and businesses of Hillcrest Gemma Jones / Jason Saunders (NZL) 1 1  2 pts \n\nInput: original sentence: Jim yelled at Kevin because he was so upset . paraphrase: Jim violently yelled at Kevin because he was so upset . \nOutput: Adverb"
    ]
}